cf/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/CommonModules/УправлениеКонтактнойИнформациейПереопределяемый/Ext/Module.bsl
// Процедура обновления ИБ для справочника видов контактной информации.
//
// Инструкция:
// Для каждого объекта, владельца КИ, для каждого соответствующего ему вида КИ добавить 
// строчку вида: УправлениеКонтактнойИнформацией.ОбновитьВидКИ(.....). При этом,
// важен порядок в котором будут осуществляться эти вызовы, чем раньше вызов для вида КИ,
// тем выше этот вид КИ будет располагаться на форме объекта.
//
// Параметры функции УправлениеКонтактнойИнформацией.ОбновитьВидКИ:
// 1. Вид КИ - Ссылка на предопределенный вид КИ.
// 2. Тип КИ - Ссылка на перечисление
// 3. МожноИзменятьСпособРедактирования  - Определяет, можно ли в режиме Предприятие изменить способ редактирования,
//                                         например, для адресов, которые попадают в регл. отчетность, нужно
//                                         запретить возможность изменения.
// 4. РедактированиеТолькоВДиалоге       - Если установить Истина, то будет значение вида КИ можно будет
//                                         редактировать только в форме ввода (имеет смысл только для
//                                         адресов, телефонов и факсов).
// 5. АдресТолькоРоссийский              - Если установить Истина, то для адресов можно будет ввести 
//                                         только российский адрес (имеет смысл только для адресов).
//
//
Процедура КонтактнаяИнформацияОбновлениеИБ() Экспорт
	
	// СтандартныеПодсистемы 
	
	// Справочник "Пользователи"
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailПользователя,        		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина, Ложь, Ложь);
	
	// Конец СтандартныеПодсистемы 
	
	// _Демо начало примера
	
	// Справочник "Организации"
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоЮрАдресОрганизации,            Перечисления.ТипыКонтактнойИнформации.Адрес,                   Ложь, Истина, Истина);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоФактАдресОрганизации,          Перечисления.ТипыКонтактнойИнформации.Адрес,                   Ложь, Истина,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоТелефонОрганизации,            Перечисления.ТипыКонтактнойИнформации.Телефон,               Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоФаксОрганизации,               Перечисления.ТипыКонтактнойИнформации.Факс,               Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоEmailОрганизации,              Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоПочтовыйАдресОрганизации,      Перечисления.ТипыКонтактнойИнформации.Адрес,                 Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоДругаяИнформацияОрганизации,   Перечисления.ТипыКонтактнойИнформации.Другое,                Истина,   Ложь,   Ложь);
	
	// Справочник "Партнеры"
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоАдресПартнера,                 Перечисления.ТипыКонтактнойИнформации.Адрес,                 Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоТелефонПартнера,               Перечисления.ТипыКонтактнойИнформации.Телефон,               Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоEmailПартнера,                 Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина,   Ложь,   Ложь);
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоEmailПартнераОтделПродаж,      Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина,   Ложь,   Ложь);

	// Справочник "Контактные лица партнеров"
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтактногоЛица,          Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина,   Ложь,   Ложь);
	
	// _Демо конец примера
	
КонецПроцедуры
